ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/HID_Standalone/Src/main.c
//{{{
static uint8_t* usbGetCfgDesc (uint16_t* length) {
  *length = sizeof(kHidCfgDesc);
  return (uint8_t*)kHidCfgDesc;
  }
//}}}
//{{{
static uint8_t usbDataIn (USBD_HandleTypeDef* device, uint8_t epnum) {
  // Ensure that the FIFO is empty before a new transfer, this condition could
  // be caused by  a new transfer before the end of the previous transfer
  ((tHidData *)device->pClassData)->mState = HID_IDLE;
  return USBD_OK;
  }
//}}}
//{{{
static uint8_t* usbGetDeviceQualifierDesc (uint16_t* length) {
  *length = sizeof (kHidDeviceQualifierDesc);
  return (uint8_t*)kHidDeviceQualifierDesc;
  }
//}}}

USBD_ClassTypeDef hidClass = {
  usbInit,
  usbDeInit,
  usbSetup,
  NULL, //EP0_TxSent
  NULL, //EP0_RxReady
  usbDataIn,
  NULL, // DataOut
  NULL, // SOF
  NULL,
  NULL,
  usbGetCfgDesc,
  usbGetCfgDesc,
  usbGetCfgDesc,
  usbGetDeviceQualifierDesc,
  };
//}}}
//{{{
static uint32_t hidGetPollingInterval (USBD_HandleTypeDef* device) {

  if (device->dev_speed == USBD_SPEED_HIGH)
    // high speed endpoints, values between 1..16 are allowed. Values correspond to interval/ of 2 ^ (bInterval-1).
    return (uint32_t)(((1 << (7 - 1)))/8);
  else
    // low, full speed endpoints
    return (uint32_t)10;
  }
//}}}
//{{{
static uint8_t hidSendReport (USBD_HandleTypeDef* device, uint8_t* report, uint16_t len) {

  //return USBD_OK;

  tHidData* hidData = (tHidData*)device->pClassData;
  if (device->dev_state == USBD_STATE_CONFIGURED) {
    if (hidData->mState == HID_IDLE) {
      hidData->mState = HID_BUSY;
      USBD_LL_Transmit (device, HID_EPIN_ADDR, report, len);
      }
    }

  return USBD_OK;
  }
//}}}

//{{{
static void onProx (int x, int y) {

  uint8_t HID_Buffer[4] = { 0,x,y,0 };
  hidSendReport (&gUsbDevice, HID_Buffer, 4);

  debug (LCD_COLOR_MAGENTA, "onProx %d %d", x, y);
  }
//}}}
//{{{
static void onPress (int x, int y) {

  uint8_t HID_Buffer[4] = { 1,0,0,0 };
  hidSendReport (&gUsbDevice, HID_Buffer, 4);

  debug (LCD_COLOR_GREEN, "onPress %d %d", x, y);
  }
//}}}
//{{{
static void onMove (int x, int y) {

  uint8_t HID_Buffer[4] = { 1,x,y,0 };
  hidSendReport (&gUsbDevice, HID_Buffer, 4);

  //gScroll += y;
  //setScrollValue (gScroll + y);

  debug (LCD_COLOR_GREEN, "onMove %d %d", x, y);
  }
//}}}
//{{{
static void onRelease (int x, int y) {

  uint8_t HID_Buffer[4] = { 0,0,0,0 };
  hidSendReport (&gUsbDevice, HID_Buffer, 4);

  debug (LCD_COLOR_GREEN, "onRelease %d %d", x, y);
  }
//}}}
//{{{
static void touch() {

  BSP_TS_GetState (&gTsState);

  if (gTsState.touchDetected)
    debug (LCD_COLOR_YELLOW, "%d x:%d y:%d w:%d e:%d a:%d g:%d",
           gTsState.touchDetected, gTsState.touchX[0],gTsState.touchY[0], gTsState.touchWeight[0],
           gTsState.touchEventId[0], gTsState.touchArea[0],
           gTsState.gestureId);

  if (gTsState.touchDetected) {
    // pressed
    if (gHit == ePressed) {
      onMove (gTsState.touchX[0] - gLastX, gTsState.touchY[0] - gLastY);
      gLastX = gTsState.touchX[0];
      gLastY = gTsState.touchY[0];
      }
    else if (gTsState.touchWeight[0] > 50) {
      gHitX = gTsState.touchX[0];
      gHitY = gTsState.touchY[0];
      onPress (gHitX, gHitY);
      gLastX = gHitX;
      gLastY = gHitY;
      gHit = ePressed;
      }
    else {
      if (gHit == eProx)
        onProx (gTsState.touchX[0] - gLastX, gTsState.touchY[0] - gLastY);
      gLastX = gTsState.touchX[0];
      gLastY = gTsState.touchY[0];
      gHit = eProx;
      }
    }
  else if (gHit) {
    // released
    onRelease (gLastX, gLastY);
    gHit = eReleased;
    }
  }
//}}}

//{{{
int main() {

  SCB_EnableICache();
  SCB_EnableDCache();
  HAL_Init();
  //{{{  config system clock
  // System Clock source            = PLL (HSE)
  // SYSCLK(Hz)                     = 216000000
  // HCLK(Hz)                       = 216000000
  // AHB Prescaler                  = 1
  // APB1 Prescaler                 = 4
  // APB2 Prescaler                 = 2
  // HSE Frequency(Hz)              = 25000000
  // PLL_M                          = 25
  // PLL_N                          = 432
  // PLL_P                          = 2
  // PLLSAI_N                       = 384
  // PLLSAI_P                       = 8
  // VDD(V)                         = 3.3
  // Main regulator output voltage  = Scale1 mode
  // Flash Latency(WS)              = 7

  // Enable HSE Oscillator and activate PLL with HSE as source
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig (&RCC_OscInitStruct) != HAL_OK)
    while (1) {}

  // Activate the OverDrive to reach the 216 Mhz Frequency
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
    while (1) {}

  // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
                                 RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig (&RCC_ClkInitStruct, FLASH_LATENCY_7) != HAL_OK)
    while (1) {}
  //}}}

  BSP_LED_Init (LED1);

  initLcd();
  BSP_TS_Init (BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
  BSP_PB_Init (BUTTON_KEY, BUTTON_MODE_GPIO);

  USBD_Init (&gUsbDevice, &hidDescriptor, 0);
  USBD_RegisterClass (&gUsbDevice, &hidClass);
  USBD_Start (&gUsbDevice);

  while (1) {
    touch();
    showLcd();
    HAL_Delay (20);
    }
  }
//}}}
